benchmark_results_replicated/20260803_085536/analysis/rep2/run/rust_mock_c200/wrk_output.txt
Running 1m test @ http://localhost:8081/days-since-mock
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.95ms  227.38us   7.00ms   84.34%
    Req/Sec    25.26k   426.19    27.81k    80.58%
  Latency Distribution
     50%    1.93ms
     75%    2.02ms
     90%    2.15ms
     99%    2.76ms
  6031893 requests in 1.00m, 730.56MB read
Requests/sec: 100469.69
Transfer/sec:     12.17MB
P95: 2297
P99: 2759